[
  {
    "name": "Buchanan's Whisky Rebuild",
    "details": "Client - 2020",
    "previewImage": "/donjulio-preview.png",
    "slug": "buchanans-rebuild",
    "article": {
      "picture-one": "",
      "paragraph-one-title": "Why?",
      "paragraph-one": "Buchanan’s Whisky is one of the most famous Scotch whisky brands in the world. The original site featured information about the Buchanan’s family, their whisky line, cocktails, and whisky culture. There was a ton of interesting content but the site’s styles were outdated and dark. The client wanted something a little bit more bright, colorful, and modern. It was decided that some site content would be re-used, but there would be a change in design. The rebuilt site would feature the same interesting site content in a more concise and visually appealing way.",
      "picture-two": "",
      "paragraph-two-title": "Build",
      "paragraph-two": "I was very excited to start working on the build after receiving the designs. The client mentioned how important SEO was so after some research I decided to go with NextJS. I have used NextJS before but have been using much more after seeing companies like Netflix, Twitch, and Hulu use the framework as well. Using NextJS, I was able to focus on coding features rather than configuration. Server-side rendering was working right out of the box and components like ‘next/head’ make writing SEO much easier. Outside of NextJS, I decided to use SCSS for styling and MobX for state management."
    }
  },
  {
    "name": "Join the Pact",
    "details": "Client - 2019",
    "previewImage": "/oban-preview.png",
    "slug": "jointhepact",
    "article": {
      "picture-one": "",
      "paragraph-one-title": "Mission",
      "paragraph-one": "The client wanted a site where users worldwide can pledge to never drink and drive. It was definitely an interesting project and I enjoyed it because I felt as if I was making a difference. As for the technical challenges, the site would be available in many different locales and it would be able to be embedded on any of the clients’ other sites. The site would also feature a map that would show how many pledges each country had.",
      "picture-two": "",
      "paragraph-two-title": "Technical Challenges",
      "paragraph-two": "The hardest part of the site was having one template page for many different locales. The dev team decided to use Gulp and we had a JSON object for each locale’s content. Through this method, we were able to achieve the goal of having one skeleton for every locale."
    }
  }
]